{
"About": {
  "Name": "Yehan Suh",
  "Currently": "Computer Science Student",
  "Headshot": "student-portrait.png",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hi, I am Yehan Suh. I am a passionate computer science student with a keen interest in software development and programming. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of computer science, with a particular focus on C++ programming.<br><br>I enjoy tackling challenging programming projects and I thrive in collaborative environments where I can contribute my expertise and learn from my peers.<br><br>Beyond the classroom, I actively engage in extracurricular activities related to computer science, including hackathons, coding competitions, and open-source contributions. I believe in the importance of continuous learning and seek out opportunities to explore new technologies and methodologies."
},
"Contact": {
  "EMail": "suhy@spu.edu",
  "Phone": "(206) 536-58582",
  "Portfolio": "YehanSuh.github.io",
  "LinkedIn": "https://www.linkedin.com/in/yehansuh0103 ",
  "GitHub": "https://github.com/YehanSuh"
},
"Experience": {
  "ExperienceText": "Use this area to explain how you got to where you are and what you are currently doing now.<br><br>This is a good spot to talk yourself up.",
  "School": "Seattle Pacific University",
  "Major": "Computer Science",
  "Graduation": "June 2024",
  "EducationText": "Use this to add some narrative to your education section",
  "Employment": "Seattle Pacific University",
  "Role": "Computer Science Lab Assistant",
  "EmploymentText": "Use this to add some narrative to your employment section",
  "Skills": ["C++", " JavaScript", " Node", " CSS"," HTML"],
  "SkillsText": "Use this to add some narrative to your skills section",
  "Resume": "Yehan Suh Resume.pdf"  
},
"Project1": {
    "Title": "Suh Yehan - System Proposal - CLace",
    "Desc": "This is a description System Proposal - CLace.<br><br>CLace is a time-keeping app based on geography that offers the best help to SPU students who are usually late for class time.<br>In the of documents, we will cover how CLace came up, how it can benefit our stakeholders, and how we will build CLace and achieve the goal most efficiently.<br> These documents will show you the system revolution and its plan, dipper investigation with much more details, functions, data, plans, and designs to announce CLace to our development team.<br><br> CLace is an innovative application designed to help children avoid wasting time and develop productive habits.<br> This document outlines how CLace is engineered to combat time-wasting and instill efficient time-management skills in young users.<br> Discover how CLace transforms students' approach to time, encouraging them to use every moment wisely.<br> Please pay close attention to the features and benefits of CLace as it guides children toward valuing and making the most of their time.<br> It will also show you the outline of CLace.<br>",
    "GitHubRepo": "https://github.com",
    "MainImage": "system proposal cover.png",
    "DetailImages": ["system proposal table of contents.png"]
  },
  "Project2": {
    "Title": "Suh Yehan - System Specification - CLace",
    "Desc": "This is a description of System Specification - CLace.<br><br>CLace is a time-keeping app based on geography that offers the best help to SPU students who are usually late for class time.<br>In the of documents, we will cover how CLace came up, how it can benefit our stakeholders, and how we will build CLace and achieve the goal most efficiently.<br> These documents will show you the system revolution and its plan, dipper investigation with much more details, functions, data, plans, and designs to announce CLace to our development team.<br><br> System Specification<br> This document serves as the system specification for the CLace development team.<br> CLace is a timekeeping application designed for Seattle Pacific University (SPU) students to help them improve their punctuality and time management skills.<br> The primary audience for this document includes developers, project managers, and stakeholders involved in the development and implementation of CLace.<br> The system will include the structural model, architecture model, security plan, and user interface.<br> ",
    "GitHubRepo": "https://github.com",
    "MainImage": "system specification cover.png",
    "DetailImages": ["system specification table of contents.png"]
  },
  "Project3": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
